Revit 2021.1 API
SymbolTypeId Properties
The SymbolTypeId type exposes the following members.
Properties
Name | Description
Acres
Ampere
Atm
Baht
Bar
Btu
BtuPerDegreeF
BtuPerH
BtuPerHFtDegreeF
BtuPerHFtSup2
BtuPerHFtSup2DegreeF
BtuPerHFtSup3
BtuPerLb
BtuPerLbDegreeF
BtuPerS
Cal
CalPerS
Cd
CdPerFtSup2
CdPerMSup2
Cf
Cfh
Cfm
CfmPerCf
CfmPerFtSup2
CfmPerFtSup3
CfmPerSf
CfmPerTon
ChineseHongKongDollar
Cm
CmCaret2
CmCaret3
Cmh
CmPerMin
Cms
CmSup2
CmSup2PerM
CmSup3
CmSup4
CmSup6
Colon1
Colon10
Colon12
CP
Cps
Custom
Cy
DaN
DaNDashM
DaNDashMPerM
DaNPerM
DaNPerMSup2
Degree
DegreeC
DegreeCInterval
DegreeF
DegreeFInterval
DegreeR
DegreeRInterval
DeltaDegreeC
DeltaDegreeF
DeltaDegreeR
DeltaK
Dm
DollarHPerBtu
DollarPerBtu
DollarPerFtSup2
DollarPerMSup2
DollarPerW
DollarPerWH
Dong
EuroPrefix
EuroSuffix
Fc
FeetOfWater
FeetOfWaterPer100ft
FL
FlLowercase
FootSingleQuote
Fpm
Fps
Ft
Ftc
FtCaret2
FtCaret3
FtH2O
FtH2OPer100ft
FtL
FtOfWater
FtOfWaterPer100ft
FtPerKip
FtPerMin
FtPerS
FtPerSSup2
FtSup2
FtSup2HPerKbtu
FtSup2PerFt
FtSup2PerKip
FtSup2PerMbh
FtSup2PerS
FtSup2PerTon
FtSup3
FtSup3HPerMinBtu
FtSup3PerH
FtSup3PerKip
FtSup3PerLbMass
FtSup3PerMin
FtSup4
FtSup6
Gal
GalPerH
GalPerMin
Gph
Gpm
Grad
GrPerHFtSup2InHg
Hectare
HFtSup2DegreeFPerBtu
Hour
Hp
Hz
In
InCaret2
InCaret3
InchDoubleQuote
InDashWg
InDashWgPer100ft
InHg
InPerSSup2
InSup2
InSup2PerFt
InSup3
InSup4
InSup6
InvDegreeC
InvDegreeF
InvKip
InvKN
Joule
JPerG
JPerGDegreeC
JPerK
JPerKgDegreeC
KA
Kcal
KcalPerS
Kelvin
KelvinInterval
Kg
Kgf
KgfDashM
KgfDashMPerM
KgfPerM
KgfPerMSup2
KgPerH
KgPerKgK
KgPerM
KgPerMH
KgPerMin
KgPerMS
KgPerMSup2
KgPerMSup3
KgPerS
Kip
KipDashFt
KipDashFtPerDegree
KipDashFtPerDegreePerFt
KipDashFtPerFt
KipPerFt
KipPerFtSup2
KipPerFtSup3
KipPerIn
KipPerInSup2
KipPerInSup3
KJ
KJPerK
KmPerH
KmPerSSup2
KN
KNDashM
KNDashMPerDegree
KNDashMPerDegreePerM
KNDashMPerM
KNPerCmSup2
KNPerM
KNPerMmSup2
KNPerMSup2
KNPerMSup3
KPa
Krone
Ksf
Ksi
KV
KVA
KW
KWh
Lbf
LbfDashFt
LbfDashFtPerFt
LbForce
LbForceDashFt
LbForceDashFtPerFt
LbForcePerFt
LbForcePerFtSup2
LbForcePerFtSup3
LbForcePerInSup2
LbForceSPerFtSup2
LbfPerFt
LbfPerFtSup2
LbfPerFtSup3
LbfPerInSup2
Lbm
LbMass
LbMassPerFt
LbMassPerFtDashH
LbMassPerFtDashS
LbMassPerFtSup2
LbMassPerFtSup3
LbMassPerH
LbMassPerInSup3
LbMassPerLbDegreeF
LbMassPerMin
LbMassPerS
LbmPerFt
LbmPerFtDashH
LbmPerFtDashS
LbmPerFtSup3
LbmPerInSup3
Lf
Liter
Lm
LmPerW
LPerH
LPerMin
LPerS
LPerSKw
LPerSMSup2
LPerSMSup3
Lpm
Lps
LpsPerMSup2
Lx
MA
Mbh
MCaret2
MCaret3
Meter
MH2O
MH2OPerM
Min
MiPerSSup2
Mm
MmCaret2
MmCaret3
MmH2O
MmH2OPerM
MmHg
MmSup2
MmSup2PerM
MmSup3
MmSup4
MmSup6
MN
MNDashM
MNDashMPerM
MNPerM
MNPerMSup2
MPa
MPerKN
MPerS
MPerSSup2
Mph
Ms
MSup2
MSup2KPerW
MSup2PerKN
MSup2PerKw
MSup2PerM
MSup2PerS
MSup3
MSup3PerH
MSup3PerHMSup2
MSup3PerHMSup3
MSup3PerKg
MSup3PerKN
MSup3PerS
MSup3PerWS
MSup4
MSup6
MV
NDashM
NDashMPerM
Newton
NgPerPaSMSup2
NPerM
NPerMmSup2
NPerMSup2
NSPerMSup2
OhmM
OneColon
Pa
PaDashS
PaPerM
Percent
PerMille
Pi
Psf
Psi
Psia
Psig
Rad
RadPerS
Rpm
Rps
Second
Sf
SfHPerKbtu
SfPerMbh
SfPerTon
Shekel
SlopeDegree
Stf
Tf
TfDashM
TfDashMPerM
TfPerM
TfPerMSup2
Therm
Ton
Tonne
TonOfRefrigeration
Tonsf
UinPerInDegreeF
UkPound
UmPerMDegreeC
UsDollar
Usft
Usgph
Usgpm
UsTonnesForceSt
UsTonnesForceT
UsTonnesForceTons
UsTonnesMassSt
UsTonnesMassT
UsTonnesMassTons
VA
Volt
Watt
WMinPerFtSup3
Won
WPerFt
WPerFtSup2
WPerFtSup3
WPerM
WPerMK
WPerMSup2
WPerMSup2K
WPerMSup3
WSPerMSup3
Yen
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace